[
  {
    "title": "Software Development Intern",
    "company": "TechCorp Solutions",
    "company_type": "trust",
    "description": "Join our dynamic software development team and work on cutting-edge web applications. You'll gain hands-on experience with modern technologies including React, Node.js, and cloud platforms. This internship offers real-world project experience and mentorship from senior developers.",
    "requirements": "Currently pursuing Computer Science or related field. Basic knowledge of programming languages (Python, JavaScript, or Java). Strong problem-solving skills and eagerness to learn new technologies.",
    "duration": "3 months",
    "stipend": "₹15,000/month",
    "location": "Bangalore, Karnataka",
    "start_date": "2024-02-01",
    "end_date": "2024-04-30",
    "application_deadline": "2024-01-25",
    "category": "Technology",
    "skills_required": "Python, JavaScript, React, Git, Problem Solving"
  },
  {
    "title": "Data Science Research Intern",
    "company": "Indian Institute of Science",
    "company_type": "government",
    "description": "Work on cutting-edge research projects in machine learning and data science. Collaborate with PhD students and faculty on real-world problems. This internship provides exposure to advanced statistical methods and machine learning algorithms.",
    "requirements": "Bachelor's or Master's in Computer Science, Statistics, or related field. Strong mathematical background. Experience with Python, R, or MATLAB. Previous research experience preferred.",
    "duration": "6 months",
    "stipend": "₹20,000/month",
    "location": "Bangalore, Karnataka",
    "start_date": "2024-03-01",
    "end_date": "2024-08-31",
    "application_deadline": "2024-02-15",
    "category": "Research",
    "skills_required": "Python, Machine Learning, Statistics, Research Methodology"
  },
  {
    "title": "Marketing Intern",
    "company": "Digital Marketing Trust",
    "company_type": "trust",
    "description": "Learn digital marketing strategies and work on real client campaigns. You'll assist in social media management, content creation, and analytics. This internship provides practical experience in the fast-growing digital marketing field.",
    "requirements": "Currently pursuing Marketing, Business, or Communications degree. Basic understanding of social media platforms. Creative thinking and strong communication skills.",
    "duration": "2 months",
    "stipend": "₹10,000/month",
    "location": "Mumbai, Maharashtra",
    "start_date": "2024-02-15",
    "end_date": "2024-04-15",
    "application_deadline": "2024-02-01",
    "category": "Business",
    "skills_required": "Social Media, Content Creation, Analytics, Communication"
  },
  {
    "title": "Healthcare Research Intern",
    "company": "All India Institute of Medical Sciences",
    "company_type": "government",
    "description": "Contribute to medical research projects and gain exposure to healthcare innovation. Work alongside medical professionals and researchers on studies that could impact patient care. This internship offers unique insights into the healthcare sector.",
    "requirements": "Currently pursuing Medicine, Biotechnology, or related healthcare field. Strong analytical skills and attention to detail. Basic knowledge of medical terminology and research methods.",
    "duration": "4 months",
    "stipend": "₹12,000/month",
    "location": "New Delhi",
    "start_date": "2024-03-15",
    "end_date": "2024-07-15",
    "application_deadline": "2024-03-01",
    "category": "Healthcare",
    "skills_required": "Medical Research, Data Analysis, Healthcare Knowledge"
  },
  {
    "title": "AI/ML Engineering Intern",
    "company": "Innovation Labs Pvt Ltd",
    "company_type": "private",
    "description": "Work on artificial intelligence and machine learning projects that solve real-world problems. You'll develop and deploy ML models, work with large datasets, and contribute to AI product development. This internship offers exposure to cutting-edge AI technologies.",
    "requirements": "Currently pursuing Computer Science, AI, or related field. Strong programming skills in Python. Knowledge of machine learning frameworks (TensorFlow, PyTorch). Mathematical background in statistics and linear algebra.",
    "duration": "5 months",
    "stipend": "₹25,000/month",
    "location": "Hyderabad, Telangana",
    "start_date": "2024-02-01",
    "end_date": "2024-06-30",
    "application_deadline": "2024-01-20",
    "category": "Technology",
    "skills_required": "Python, Machine Learning, TensorFlow, PyTorch, Statistics"
  },
  {
    "title": "Education Technology Intern",
    "company": "Ministry of Education",
    "company_type": "government",
    "description": "Contribute to digital education initiatives and help develop educational technology solutions. Work on projects that aim to improve access to quality education across India. This internship offers experience in the intersection of technology and education.",
    "requirements": "Currently pursuing Education, Computer Science, or related field. Interest in educational technology and digital learning. Strong communication skills and passion for education.",
    "duration": "3 months",
    "stipend": "₹8,000/month",
    "location": "New Delhi",
    "start_date": "2024-04-01",
    "end_date": "2024-06-30",
    "application_deadline": "2024-03-15",
    "category": "Education",
    "skills_required": "Educational Technology, Communication, Digital Learning"
  },
  {
    "title": "Cybersecurity Intern",
    "company": "SecureTech Foundation",
    "company_type": "trust",
    "description": "Learn about cybersecurity best practices and work on security assessment projects. You'll gain hands-on experience with penetration testing, vulnerability assessment, and security monitoring. This internship provides valuable skills in the growing cybersecurity field.",
    "requirements": "Currently pursuing Computer Science, Information Security, or related field. Basic understanding of networking and operating systems. Interest in cybersecurity and ethical hacking.",
    "duration": "4 months",
    "stipend": "₹18,000/month",
    "location": "Pune, Maharashtra",
    "start_date": "2024-03-01",
    "end_date": "2024-06-30",
    "application_deadline": "2024-02-15",
    "category": "Technology",
    "skills_required": "Cybersecurity, Networking, Linux, Ethical Hacking"
  },
  {
    "title": "Environmental Research Intern",
    "company": "Ministry of Environment, Forest and Climate Change",
    "company_type": "government",
    "description": "Work on environmental conservation projects and climate change research. Contribute to studies on biodiversity, pollution control, and sustainable development. This internship offers experience in environmental policy and research.",
    "requirements": "Currently pursuing Environmental Science, Biology, or related field. Strong research skills and interest in environmental issues. Basic knowledge of data analysis and scientific methods.",
    "duration": "6 months",
    "stipend": "₹10,000/month",
    "location": "New Delhi",
    "start_date": "2024-02-01",
    "end_date": "2024-07-31",
    "application_deadline": "2024-01-20",
    "category": "Research",
    "skills_required": "Environmental Science, Research, Data Analysis, Sustainability"
  },
  {
    "title": "Financial Analysis Intern",
    "company": "Economic Research Foundation",
    "company_type": "trust",
    "description": "Analyze economic data and contribute to financial research projects. Work on market analysis, economic forecasting, and policy research. This internship provides exposure to financial markets and economic analysis.",
    "requirements": "Currently pursuing Economics, Finance, or related field. Strong analytical and quantitative skills. Knowledge of Excel and statistical software. Interest in financial markets and economic policy.",
    "duration": "3 months",
    "stipend": "₹15,000/month",
    "location": "Mumbai, Maharashtra",
    "start_date": "2024-03-01",
    "end_date": "2024-05-31",
    "application_deadline": "2024-02-15",
    "category": "Business",
    "skills_required": "Financial Analysis, Excel, Statistics, Economics"
  },
  {
    "title": "UI/UX Design Intern",
    "company": "Creative Design Studio",
    "company_type": "private",
    "description": "Design user interfaces and user experiences for web and mobile applications. Work on wireframing, prototyping, and user research. This internship offers hands-on experience in modern design tools and methodologies.",
    "requirements": "Currently pursuing Design, Computer Science, or related field. Basic knowledge of design principles and tools. Creative thinking and attention to detail. Portfolio of design work preferred.",
    "duration": "4 months",
    "stipend": "₹12,000/month",
    "location": "Chennai, Tamil Nadu",
    "start_date": "2024-02-15",
    "end_date": "2024-06-15",
    "application_deadline": "2024-02-01",
    "category": "Technology",
    "skills_required": "UI/UX Design, Figma, Adobe Creative Suite, User Research"
  },
  {
    "title": "Agricultural Technology Intern",
    "company": "Indian Council of Agricultural Research",
    "company_type": "government",
    "description": "Work on agricultural technology projects and help develop solutions for farmers. Contribute to research on crop improvement, soil health, and sustainable farming practices. This internship offers experience in agricultural innovation.",
    "requirements": "Currently pursuing Agriculture, Biotechnology, or related field. Interest in agricultural technology and sustainable farming. Basic knowledge of agricultural practices and research methods.",
    "duration": "5 months",
    "stipend": "₹9,000/month",
    "location": "New Delhi",
    "start_date": "2024-03-01",
    "end_date": "2024-07-31",
    "application_deadline": "2024-02-15",
    "category": "Research",
    "skills_required": "Agricultural Science, Research, Technology, Sustainability"
  },
  {
    "title": "Content Writing Intern",
    "company": "Media Communications Trust",
    "company_type": "trust",
    "description": "Create engaging content for various platforms including blogs, social media, and websites. Work on content strategy, SEO optimization, and brand communication. This internship offers experience in digital content creation and marketing.",
    "requirements": "Currently pursuing English, Journalism, or related field. Excellent writing and communication skills. Basic knowledge of SEO and content marketing. Creative thinking and attention to detail.",
    "duration": "2 months",
    "stipend": "₹8,000/month",
    "location": "Kolkata, West Bengal",
    "start_date": "2024-04-01",
    "end_date": "2024-05-31",
    "application_deadline": "2024-03-20",
    "category": "Business",
    "skills_required": "Content Writing, SEO, Social Media, Communication"
  }
]
